---
type: ModelCurveNode
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# ModelCurveNode

`Autodesk.Revit.DB.ModelCurveNode` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | LineProperties | 2016 | `public LineProperties LineProperties { get ; }` |